####Create  "Pivot Table" and Save to File
    COPY (select costumerhash,
         array_agg(ROW(productkey,unit_sum))
    AS units_list
    FROM(
          SELECT costumerhash, productkey,
              SUM(units) AS unit_sum
              FROM purchases
              GROUP BY costumerhash, productkey
      ) AS row
    GROUP BY costumerhash
    ORDER BY costumerhash)

    TO '/Users/Alexander/pivot_tabe.csv' 
    (FORMAT CSV, DELIMITER ',');

    00000F7264C27BA6FEA0C837ED6AA0AA | {"(202463,1)","(202922,1)","(205598,1)","(214365,1)","(214573,1)}
    0000219E4B37D2504FB6B8C28E24A2D4 | {"(25604,1)"}
    000051F32D02C8A53B43A686969676E6 | {"(91836,1)","(107120,1)","(107193,1)","(109231,1)","(111359,1)}
    00005C2D819C584E32298F8729C4B1D7 | {"(22374,3)","(256047,7)"}
    00006C661B0C80EF519BA561E321D100 | {"(363343,2)"}
    0000702EE4CEFDB1E7F89084E50D3C85 | {"(362634,1)"}

##Basic Exploration

1. What are the tables in our database? Run `\d` to find out.


    readychef-# \d
               List of relations
     Schema |   Name    | Type  |   Owner   
    --------+-----------+-------+-----------
     public | events    | table | Alexander
     public | meals     | table | Alexander
     public | referrals | table | Alexander
     public | users     | table | Alexander
     public | visits    | table | Alexander
    (5 rows)




2. What columns does each table have? Run `\d tablename` to find out.


    readychef-# \d events
              Table "public.events"
     Column  |       Type        | Modifiers 
    ---------+-------------------+-----------
     dt      | date              | 
     userid  | integer           | 
     meal_id | integer           | 
     event   | character varying |

Select statements
===================

1) To get an understanding of the data, run a [SELECT](http://www.postgresqltutorial.com/postgresql-select/) statement on each table. Keep all the columns and limit the number of rows to 10.

        SELECT * 
        FROM events 
        LIMIT 10;
             dt     | userid | meal_id | event  
        ------------+--------+---------+--------
         2013-01-01 |      3 |      18 | bought
         2013-01-01 |      7 |       1 | like
         2013-01-01 |     10 |      29 | bought
         2013-01-01 |     11 |      19 | share
         2013-01-01 |     15 |      33 | like
         2013-01-01 |     18 |       4 | share
         2013-01-01 |     18 |      40 | bought
         2013-01-01 |     21 |      10 | share
         2013-01-01 |     21 |       4 | like
         2013-01-01 |     22 |      23 | bought
        (10 rows)
    

2) Write a `SELECT` statement that would get just the userids.

        SELECT userid from visits;


3) Maybe you're just interested in what the campaign ids are. Use 'SELECT DISTINCT' to figure out all the possible values of that column.


        SELECT campaign_id FROM users;

Where Clauses / Filtering
========================================


1) Using the `WHERE` clause, write a new `SELECT` statement that returns all rows where `Campaign_ID` is equal to `FB`.

        SELECT campaign_id 
        FROM users 
        WHERE campaign_id = 'FB';

    readychef=# select campaign_id from users where campaign_id = 'FB' limit 10;
     campaign_id 
    -------------
     FB
     FB
     FB
     FB
     FB
     FB
     FB
     FB
     FB
     FB
    (10 rows)


2) We don't need the campaign id in the result since they are all the same, so only include the other two columns.

    SELECT userid, dt
    FROM users
    WHERE campaign_id = 'FB';

    readychef=# select userid, dt  from users where campaign_id = 'FB' limit 10;
     userid |     dt     
    --------+------------
          3 | 2013-01-01
          4 | 2013-01-01
          5 | 2013-01-01
          6 | 2013-01-01
          8 | 2013-01-01
          9 | 2013-01-01
         12 | 2013-01-01
         17 | 2013-01-01
         19 | 2013-01-01
         24 | 2013-01-01
    (10 rows)


Aggregation Functions
=======================

1) Write a query to get the count of just the users who came from Facebook.

        SELECT COUNT(*) 
        FROM users 
        WHERE campaign_id = 'FB';

2) Now, count the number of users coming from each service. Here you'll have to group by the column you're selecting with a [GROUP BY](http://www.postgresql.org/docs/8.0/static/sql-select.html#SQL-GROUPBY) clause.

        SELECT campaign_id, COUNT(*) 
        From users 
        GROUP BY campaign_id;
        
         campaign_id | count 
        -------------+-------
         RE          |  1724
         FB          |  4384
         TW          |  3764
         PI          |  1176
        (4 rows)

3) Use `COUNT (DISTINCT columnname)` to get the number of unique dates that appear in the `users` table.


       SELECT campaign_id, 
       COUNT(distinct dt) 
       FROM users 
       GROUP BY campaign_id;
       
         campaign_id | count 
        -------------+-------
         FB          |   331
         PI          |   251
         RE          |   285
         TW          |   328
        (4 rows)


4) There's also `MAX` and `MIN` functions, which do what you might expect. Write a query to get the first and last registration date from the `users` table.

        
        SELECT MAX(dt), 
               MIN(dt)
        From users;
            max     |    min     
        ------------+------------
         2013-12-31 | 2013-01-01
        (1 row)

5) Calculate the mean price for a meal (from the `meals` table).

        SELECT AVG(price)
        FROM meals;
        
                 avg         
        ---------------------
         10.6522829904666332
        (1 row)


6) Now get the average price, the min price and the max price for each meal type.


        SELECT type, AVG(price),MIN(price),MAX(price) 
        FROM meals 
        GROUP BY type;
        
        
        type    |         avg         | min | max 
    ------------+---------------------+-----+-----
     mexican    |  9.6975945017182131 |   6 |  13
     french     | 11.5420000000000000 |   7 |  16
     japanese   |  9.3804878048780488 |   6 |  13
     italian    | 11.2926136363636364 |   7 |  16
     chinese    |  9.5187165775401070 |   6 |  13
     vietnamese |  9.2830188679245283 |   6 |  13
    (6 rows)

7)  Alias all the above columns

        SELECT type, AVG(price) as avg_price , MIN(price) as min_price, MAX(price) as max_price 
        FROM meals  
        GROUP BY type;
            type    |      avg_price      | min_price | max_price 
        ------------+---------------------+-----------+-----------
         mexican    |  9.6975945017182131 |         6 |        13
         french     | 11.5420000000000000 |         7 |        16
         japanese   |  9.3804878048780488 |         6 |        13
         italian    | 11.2926136363636364 |         7 |        16
         chinese    |  9.5187165775401070 |         6 |        13
         vietnamese |  9.2830188679245283 |         6 |        13
        (6 rows)
        
        
8) Add a `WHERE` clause to the above query to consider only meals in the first quarter of 2013 (month<=3 and year=2013)


        SELECT type , AVG(price), MIN(price), MAX(price) 
        FROM meals 
        WHERE date_part('month',  dt) <= 3 AND date_part('year',  dt)= 2013 
        GROUP BY type;


            type    |         avg         | min | max 
        ------------+---------------------+-----+-----
         mexican    |  9.6951219512195122 |   6 |  13
         french     | 11.7522123893805310 |   7 |  16
         japanese   |  9.6521739130434783 |   6 |  13
         vietnamese |  9.3750000000000000 |   6 |  13
         italian    | 11.0877192982456140 |   7 |  16
         chinese    |  9.7727272727272727 |   6 |  13
        (6 rows)





9) Modify the above query so that we get the aggregate values for each month and type

        SELCT date_part('month',  dt)  ,   type , avg( price), min(price), max(price) 
        FROM meals 
        WHERE date_part('month',  dt) <= 3 AND date_part('year',  dt)= 2013 
        GROUP BY date_part('month',  dt),  type;



     date_part |    type    |         avg         | min | max 
    -----------+------------+---------------------+-----+-----
             1 | mexican    | 10.3823529411764706 |   6 |  13
             2 | japanese   |  9.9166666666666667 |   6 |  13
             3 | mexican    |  9.6250000000000000 |   6 |  13
             3 | french     | 12.5238095238095238 |   8 |  16
             2 | vietnamese |  9.6000000000000000 |   7 |  13
             1 | chinese    | 11.2307692307692308 |   8 |  13
             2 | italian    | 11.2666666666666667 |   7 |  16
             3 | chinese    |  9.2500000000000000 |   6 |  13
             2 | french     | 10.8387096774193548 |   7 |  16
             2 | mexican    |  8.7916666666666667 |   6 |  13
             3 | japanese   |  9.5238095238095238 |   6 |  13
             1 | japanese   |  9.6153846153846154 |   6 |  13
             1 | italian    | 10.8030303030303030 |   7 |  16
             2 | chinese    |  9.0666666666666667 |   6 |  13
             3 | italian    | 11.2666666666666667 |   7 |  16
             3 | vietnamese |  8.8235294117647059 |   6 |  13
             1 | vietnamese | 10.8000000000000000 |   6 |  13
             1 | french     | 11.6500000000000000 |   7 |  16
    (18 rows)



10) From the `events` table, write a query that gets the total number of buys, likes and shares for each meal id. To avoid having to do this as three separate queries you can do the count of the number of buys like this: `SUM(CASE WHEN event='bought' THEN 1 ELSE 0 END)`.


            SELECT sum( case when event = 'bought' then 1 else 0 end )
            AS bought, 
            sum( case when event = 'like' then 1 else 0 end )AS like, 
            sum( case when event = 'share' then 1 else 0 end )AS share 
            FROM events;

         bought |  like  | share  
        --------+--------+--------
         128538 | 249994 | 257708
        (1 row)

Sorting
==========================================

1) Let's start with a query which gets the average price for each type. It will be helfpul to alias the average price column as 'avg_price'.


        SELECT type, AVG(price) AS avg_price
        FROM meals 
        GROUP BY type;
        
            type    |      avg_price      
        ------------+---------------------
         mexican    |  9.6975945017182131
         french     | 11.5420000000000000
         japanese   |  9.3804878048780488
         italian    | 11.2926136363636364
         chinese    |  9.5187165775401070
         vietnamese |  9.2830188679245283
        (6 rows)


2) To make it easier to read, sort the results by the `type` column. You can do this with an [ORDER BY](http://www.postgresqltutorial.com/postgresql-order-by/) clause.

        SELECT type, AVG(price) AS avg_price 
        FROM meals GROUP BY type  
        ORDER BY type ASC;
        
            type    |      avg_price      
        ------------+---------------------
         chinese    |  9.5187165775401070
         french     | 11.5420000000000000
         italian    | 11.2926136363636364
         japanese   |  9.3804878048780488
         mexican    |  9.6975945017182131
         vietnamese |  9.2830188679245283
        (6 rows)



3) Now return the same table again, except this time order by the price in descending order (add the `DESC` keyword).


        SELECT type, AVG(price) AS avg_price 
        FROM meals GROUP BY type  
        ORDER BY avg_price desc;


            type    |      avg_price      
        ------------+---------------------
         french     | 11.5420000000000000
         italian    | 11.2926136363636364
         mexican    |  9.6975945017182131
         chinese    |  9.5187165775401070
         japanese   |  9.3804878048780488
         vietnamese |  9.2830188679245283
        (6 rows)


4) Sometimes we want to sort by two columns. Write a query to get all the meals, but sort by the type and then by the price. You should have an order by clause that looks something like this: `ORDER BY col1, col2`.

        SELECT type, AVG(price) AS avg_price 
        FROM meals 
        GROUP BY type  
        ORDER BY type,  avg_price;

            type    |      avg_price      
        ------------+---------------------
         chinese    |  9.5187165775401070
         french     | 11.5420000000000000
         italian    | 11.2926136363636364
         japanese   |  9.3804878048780488
         mexican    |  9.6975945017182131
         vietnamese |  9.2830188679245283



5) For shorthand, people sometimes use numbers to refer to the columns in their order by or group by clauses. The numbers refer to the order they are in the select statement. For instance `SELECT type, dt FROM meals ORDER BY 1;` would order the resutls by the `type` column.


        SELECT type, AVG(price) AS avg_price 
        FROM meals 
        GROUP BY 1  
        ORDER BY 1,  2;

            type    |      avg_price      
        ------------+---------------------
         chinese    |  9.5187165775401070
         french     | 11.5420000000000000
         italian    | 11.2926136363636364
         japanese   |  9.3804878048780488
         mexican    |  9.6975945017182131
         vietnamese |  9.2830188679245283

Joins
=========================


1) Write a query to get one table that joins the `events` table with the `users` table (on `userid`) to create the following table.

        SELECT users.userid, users.campaign_id, events.meal_id,events.event 
        FROM users 
        INNER JOIN events on users.userid = events.userid 
        LIMIT 5;


         userid | campaign_id | meal_id | event  
        --------+-------------+---------+--------
              3 | FB          |      18 | bought
              3 | FB          |      18 | bought
              7 | PI          |       1 | like
              7 | PI          |       1 | like
             10 | TW          |      29 | bought
        (5 rows)


2) Also include information about the meal, like the `type` and the `price`. Only include the `bought` events. The result should look like this:


        SELECT users.userid, users.campaign_id, events.meal_id, meals.type, meals.price  
        FROM users 
        INNER JOIN events ON users.userid = events.userid 
        INNER JOIN meals ON  meals.meal_id = events.meal_id AND events.event = 'bought' 
        LIMIT 3;


         userid | campaign_id | meal_id |   type   | price 
        --------+-------------+---------+----------+-------
              3 | FB          |      18 | french   |     9
             10 | TW          |      29 | italian  |    15
             18 | TW          |      40 | japanese |    13
             22 | RE          |      23 | mexican  |    12
             25 | FB          |       8 | french   |    14
             28 | TW          |      18 | french   |     9
        (6 rows)


3) Write a query to get how many of each type of meal were bought.



        SELECT meals.type, 
        SUM(CASE WHEN event='bought' THEN 1 ELSE 0 END) AS bought  
        FROM meals INNER JOIN events ON meals.meal_id = events.meal_id 
        GROUP BY meals.type;

            type    | bought 
        ------------+--------
         mexican    |   8792
         french     |  16179
         japanese   |   6921
         italian    |  22575
         chinese    |   6267
         vietnamese |   3535
        (6 rows)

Subqueries
================================

1) Write a query to get meals that are above the average meal price.

        SELECT meals.* 
        FROM meals 
        WHERE meals.price >  ( select  avg(meals.price) 
        AS avg_price FROM meals) 
        LIMIT 10 ;
        
         meal_id |    type    |     dt     | price 
        ---------+------------+------------+-------
               2 | chinese    | 2013-01-01 |    13
               5 | chinese    | 2013-01-03 |    12
               8 | french     | 2013-01-03 |    14
               9 | italian    | 2013-01-03 |    13
              12 | mexican    | 2013-01-03 |    12
              15 | italian    | 2013-01-04 |    11
              16 | italian    | 2013-01-04 |    15
              17 | french     | 2013-01-04 |    15
              19 | japanese   | 2013-01-04 |    11
              21 | vietnamese | 2013-01-04 |    12
        (10 rows)

2) Write a query to get the meals that are above the average meal price *for that type*.


         select meals.*, average.avg 
         from meals 
         join ( select meals.type,  avg(meals.price) from meals group by meals.type ) 
         as average 
         on meals.type = average.type 
         where meals.price > average.avg 
         limit 10;
         meal_id |    type    |     dt     | price |         avg         
        ---------+------------+------------+-------+---------------------
               2 | chinese    | 2013-01-01 |    13 |  9.5187165775401070
               5 | chinese    | 2013-01-03 |    12 |  9.5187165775401070
               8 | french     | 2013-01-03 |    14 | 11.5420000000000000
               9 | italian    | 2013-01-03 |    13 | 11.2926136363636364
              12 | mexican    | 2013-01-03 |    12 |  9.6975945017182131
              16 | italian    | 2013-01-04 |    15 | 11.2926136363636364
              17 | french     | 2013-01-04 |    15 | 11.5420000000000000
              19 | japanese   | 2013-01-04 |    11 |  9.3804878048780488
              21 | vietnamese | 2013-01-04 |    12 |  9.2830188679245283
              22 | italian    | 2013-01-04 |    12 | 11.2926136363636364
        (10 rows)




3) Modify the above query to give a count of the number of meals per type that are above the average price.

        SELECT meals.type, COUNT(meals.type) 
        FROM meals join ( SELECT meals.type,  AVG(meals.price) 
        FROM meals GROUP BY meals.type ) AS average 
        ON meals.type = average.type 
        WHERE meals.price > average.avg 
        GROUP BY meals.type;
            type    | count 
        ------------+-------
         mexican    |   152
         french     |   243
         japanese   |    99
         italian    |   332
         chinese    |    95
         vietnamese |    47
        (6 rows)


4) Calculate the percentage of users which come from each service. This query will look similar to #2 from aggregation functions, except you have to divide by the total number of users.

        SELECT users.campaign_id, count(users.campaign_id )/ 
        (select  cast ( count(users.campaign_id) as real) from users ) 
        AS precent  
        FROM users 
        GROUP BY users.campaign_id;
         campaign_id |      precent      
        -------------+-------------------
         RE          | 0.156046343229544
         FB          | 0.396813902968863
         TW          | 0.340695148443157
         PI          | 0.106444605358436
        (4 rows)